{"id":243137,"date":"2022-05-20T21:02:22","date_gmt":"2022-05-20T21:02:22","guid":{"rendered":"https:\/\/blueprintexpansion.com\/?p=243137"},"modified":"2022-10-19T23:23:20","modified_gmt":"2022-10-19T23:23:20","slug":"is-there-safety-in-early-stage-today","status":"publish","type":"post","link":"https:\/\/blueprintexpansion.com\/blog\/is-there-safety-in-early-stage-today\/","title":{"rendered":"Is There Safety in Early-Stage Today?"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.18.0&#8243; hover_enabled=&#8221;0&#8243; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221; custom_padding_last_edited=&#8221;on|tablet&#8221; custom_padding_tablet=&#8221;5%||0px||false|false&#8221; sticky_enabled=&#8221;0&#8243; custom_padding_phone=&#8221;3%||||false|false&#8221;][et_pb_row _builder_version=&#8221;4.18.0&#8243; background_size=&#8221;initial&#8221; background_position=&#8221;top_left&#8221; background_repeat=&#8221;repeat&#8221; hover_enabled=&#8221;0&#8243; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221; custom_padding_last_edited=&#8221;on|tablet&#8221; custom_padding_tablet=&#8221;0px||||false|false&#8221; sticky_enabled=&#8221;0&#8243; custom_padding_phone=&#8221;0px||||false|false&#8221;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.16&#8243; custom_padding=&#8221;|||&#8221; global_colors_info=&#8221;{}&#8221; custom_padding__hover=&#8221;|||&#8221; theme_builder_area=&#8221;post_content&#8221;][et_pb_text _builder_version=&#8221;4.18.0&#8243; ol_font=&#8221;||||||||&#8221; background_size=&#8221;initial&#8221; background_position=&#8221;top_left&#8221; background_repeat=&#8221;repeat&#8221; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221;]<\/p>\n<p>It&#8217;s harder today.<\/p>\n<p>Running a new job search has become stressful &amp; more difficult for GTM professionals. While demand for tech talent remains strong, news of layoffs and public market declines saturate social media feeds. Even optimists acknowledge it&#8217;s difficult to predict whether we are about to slide into a short-term recession.<\/p>\n<p>Is now a time for sales, marketing, and customer success talent to prioritize opportunity with larger companies over mid-market and tech startups? Are the larger organizations more &#8220;stable&#8221;?<\/p>\n<p>One could plausibly make the argument. While behemoths like Microsoft, Amazon, and Alphabet are <a href=\"https:\/\/observer.com\/2022\/05\/in-tech-the-rich-get-richer-as-big-companies-raise-pay-while-struggling-startups-lay-off-workers\/\" target=\"_blank\" rel=\"noopener\">announcing wage increases<\/a> to minimize employee churn due to inflation, venture capital flow into earlier stage companies is uniformly slowing down. Many startups, in turn, are implementing hiring freezes and cuts to reduce cash burn rates and extend their runway. Even companies aggressively courting enterprise sellers may be looking to reduce their Customer Acquisition Costs (CAC) in other areas, which may not be favorable for those expecting marketing and product development support.<\/p>\n<p>In this context, it&#8217;s understandably easy to conclude that now is a great time to index to large cap tech for job searchers.<\/p>\n<p>From a talent perspective, however, I&#8217;m not sure I&#8217;d equate size with stability.<br \/>Looking back to 2008-2009, layoffs <a href=\"https:\/\/www.cnet.com\/tech\/tech-industry\/tech-layoffs-the-scorecard\/\" target=\"_blank\" rel=\"noopener\">didn&#8217;t spare many of the larger tech brands<\/a>. And while this period predates the emergence of mature SaaS, comparisons still seem reasonable. We face unique challenges today: a reduction in <a href=\"https:\/\/www.meritechcapital.com\/blog\/2022-saas-crash\" target=\"_blank\" rel=\"noopener\">SaaS valuations related to rising interest rates<\/a> and the potential for declining earnings themselves impacting multiples. If the Fed is hindered in its ability to inject greater liquidity in the market because of inflation, things have the potential to get worse. In these circumstances, larger organizations may feel compelled to make larger-scale cuts to business units and functions for their shareholders. &#8220;Last in \/ first out&#8221; is certainly not a phrase I associate with startups as much as larger companies scrambling to make broader scale cuts while mitigating litigation risk.<\/p>\n<p>The point here is hardly to promote doom and gloom. We&#8217;ve never seen circumstances quite like this; many have made very plausible arguments that we are looking at a speed bump at worst, not a massive correction. None of us has a crystal ball, but there&#8217;s certainly a case for cautious optimism.<\/p>\n<p>That said, I&#8217;d like to make a case here that now could be uniquely the time for job seekers to give startups and early companies more attention. But not all of them are created equal. What&#8217;s right for one individual may not make sense for someone else.<br \/>Here are some things I&#8217;d recommend.<\/p>\n<ol>\n<li style=\"margin-bottom: 20px;\"><strong>Consider looking for companies tackling major problems in underserved or &#8220;unsexy&#8221; markets.<\/strong> When I left the martech space to join a company in trucking \/ logistics, many of my former peers found the move curious. Five years later, that market has grown massively. Most of us are deeply attentive to the importance of efficiency in logistics and the global supply chain, but many founders understood the challenges and needs earlier. Think like the best investors here and look for companies doing things being missed by others. For example, I have a couple Series A clients in data privacy and compliance operations space doing exceptional work to help companies maintain constituent trust, operational efficiency, and brand \/ business viability. Talk about important value props! Are you looking in these areas for opportunity? If not, why not?<\/li>\n<li style=\"margin-bottom: 20px;\"><strong>Pay attention to funding, but don&#8217;t over index on the size of the round.<\/strong> Larger amounts raised, particularly in plush times, often generate a lot of excitement from investors and employees, but these can create more risk in environments like today&#8217;s. Companies that raise money based on excessive valuations could face greater pressures from their investors to pump the brakes harder on spending and hiring. Why? If these companies need to raise another round, they may be forced to take a &#8220;down round&#8221; investment at a lower valuation &#8211; bad for investors, and employees watching their ISOs vest. Not everyone can simply pivot from &#8220;growth at all costs&#8221; to &#8220;responsible growth&#8221; IF prior rounds were raised on the former grounds. By contrast, companies that raised money at more reasonable valuations may be better equipped to raise additional money or consider debt options. If you can find a company like this that&#8217;s also growing at an impressive YoY\/MoM rate, you may have a winner on your hands.<\/li>\n<li style=\"margin-bottom: 20px;\"><strong>Look at the leadership team.<\/strong> Have they survived prior downturns? What&#8217;s their overall management experience? How closely do their values comport with yours? What&#8217;s the diversity of the team? (Here I mean more than traditional DEI; if everyone comes from the same Ivy League college, ask yourself: is this a company that&#8217;s prioritizing cozy cronyism over diversity of thought to drive excellence?)<\/li>\n<li style=\"margin-bottom: 20px;\"><strong>How confident are you in their product market fit (PMF) and current customer base?<\/strong> Do they have a track record retaining and growing clients? Is there an additional larger market to pursue? Can you get your head around it? The latter question is relevant too. It&#8217;s okay to acknowledge it may not pique your interest.<\/li>\n<li style=\"margin-bottom: 20px;\"><strong>What&#8217;s the hiring process?<\/strong> Is it clear and documented? Can the company walk you through the steps to offer? Also, do they have a plan they can share for future hiring planned throughout the year? What are the dependencies? Transparency is always great &#8211; now is the time to push for this harder than ever. (Another side note: I would spend MORE time asking about the plan, less asking for historical &#8216;performance data&#8217;. Asking a startup revenue leader &#8220;how many reps hit quota last year&#8221; gives you a lot less insight into their preparedness for future execution.<\/li>\n<li style=\"margin-bottom: 20px;\"><strong>How well does the role align to your skills &amp; behaviors?<\/strong> Your growth goals? Is there a chance for you to build on existing skills and be fulfilled in the meantime? If the company doesn&#8217;t prove viable, what&#8217;s your confidence that the work you do will help succeed in your next role?<\/li>\n<li><strong>Be sure start-up work is right for you.<\/strong> In bullish and bearish times, work in early-stage companies is always a little different. If you are not comfortable with some level of ambiguity, it may not make sense. Or perhaps you want to deepen functionally specific skills as a priority. In this case, finding a more mature organization with a reputation for excellence in your lane could be the better move.<\/li>\n<\/ol>\n<p>In 2008, <a href=\"https:\/\/www.foxbusiness.com\/markets\/startups-great-recession\" target=\"_blank\" rel=\"noopener\">some incredible companies were founded during the downturn<\/a> . What&#8217;s great for an investor is not necessarily great for you from a career perspective. That said, if you can find great opportunities in a market with role opportunities that get you excited, now could prove to be an incredible time to go early company in your career.<\/p>\n<p>Is there safety in early-stage today? Difficult to say whether the relative risks here outweigh those in other verticals or more mature companies. But if startups get you excited, I wouldn&#8217;t take it off the table.<\/p>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Is now a time for sales, marketing, and customer success talent to prioritize opportunities with larger companies over startups?<\/p>\n","protected":false},"author":6,"featured_media":243138,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"on","_et_pb_old_content":"<p>TIPS FOR EXPANSION IN THE SOUTHEAST<\/p><p>Although 2020 has been a challenging year, the growth of remote hiring has fostered new opportunities across the country. Companies have learned they can hire exceptional talent at reasonable salaries while reducing overhead. Employees, no longer faced with paying exorbitant rents to live near headquarters, now have options to relocate anywhere.<\/p><p>So what’s the problem?<\/p><p>While great people resides everywhere, much of the southeast get less attention due to preconceptions and bias.  In fact, some regions here likely offer the most promising opportunities for responsible growth.<\/p><p>Interested in talent expansion in the southeast?  Here are 3 tips to ensure the best likelihood for success.<\/p><p>1. CHECK YOUR ASSUMPTIONS (AND UNCONSCIOUS BIAS) AT THE DOOR<br \/>Ensure you put consistent process in place to guard against bias.  Sounds simple enough right?<\/p><p>What happens when you don’t recognize a candidate’s university?  How do you react when you hear a ‘tang’ in the way someone pronounces certain words? Are you projecting assumptions onto the candidate from across the Zoom?<\/p><p>After working for multiple tech startups in Nashville, I’ve heard it all about the local talent pool. People here are “too polite,” slow to act, dripping in southern drawl, lacking “relevant experience.” These assumptions harm both employer and employee alike.<\/p><p>Also, take a look at how regional bias impacts your diversity and inclusion goals. The southeast is home to some of the most well renowned and prestigious HBCU’s in America. Here we have metros like Memphis (where I grew up) with diverse and established Black American populations. Neglecting these locations may mean you are constraining your remote search to areas of the country with less of the diversity needed to strengthen your company.<\/p><p>2. CONSIDER OPPORTUNITIES FOR INCENTIVES<br \/>The southeast boasts attractive grant opportunities and a relatively modest cost of living. Ensure you understand the landscape for employer and employee alike. Even if you only plan to make a modest number of hires in a certain remote region or state, you could be missing out on potential benefits available.<\/p><p>Before investing in hiring and recruitment, learn thoroughly about the partnerships and resources available to help. State, county, and chamber resources can provide guidance on grants and incentives available.  Many regional universities have different programs available as well to help promote your company’s presence to undergraduates and graduate students.<\/p><p>3. PLAN WITH PURPOSE<br \/>For all of the talk about the value of remote work in giving people opportunities to live anywhere, it’s difficult to attract exceptional people in remote regions without a clear plan. Employee prospects want to understand your vision and objectives for hiring in their region, and the dependencies.  Are you simply searching for people anywhere because your office is currently closed?  Are you considering opening up a satellite office or temporary presence in another region?  Do you plan to change you policies down the line to require people to live near headquarters?  Be transparent and open in your communication at all times.  This does not mean you need to have your hiring plan set in stone, or all of the specific details figured out.  But it does mean you should at least have a roadmap.<\/p><p>Also, when planning, consider the wider range of benefits to concentrating your efforts on one or specific regions in the country. What does success look like? Aside from being able to access state grants that reduce your operating expenses, taking a geographical focus to your expansion can help you meet other business goals, including improving sales execution with personnel closer to your sales prospects, improving customer relationships with increased hours of operations, and achieving resiliency in the event that you decide to shut down your current headquarters.<\/p><p>Consider your vision for potential relocation opportunities for employees looking to move out from headquarters.  You may want to get temporary or permanent office space, ensure you have a strong broker partner to guide your search efforts and give you a deep sense of the options available in the region.<\/p><p>TALENT EXPANSION – CLOSE<br \/>If you’ve decided you want to focus on the southeast, that’s great! Now what? For tips on how to best deploy your resources click on the link here requesting a 30 minute free consultation to evaluate your options and provide tailored next steps.<\/p>","_et_gb_content_width":""},"categories":[9],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.10 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Is There Safety in Early-Stage Today? - Blueprint<\/title>\n<meta name=\"description\" content=\"Is now a time for sales, marketing, &amp; customer success talent to prioritize working at larger companies over mid-market and tech startups?\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Is There Safety in Early-Stage Today? - Blueprint\" \/>\n<meta property=\"og:description\" content=\"Is now a time for sales, marketing, &amp; customer success talent to prioritize working at larger companies over mid-market and tech startups?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/\" \/>\n<meta property=\"og:site_name\" content=\"Blueprint\" \/>\n<meta property=\"article:published_time\" content=\"2022-05-20T21:02:22+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-10-19T23:23:20+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2022\/05\/stacked-meditation-rocks.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"400\" \/>\n\t<meta property=\"og:image:height\" content=\"400\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Chuck Brotman\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@bp_expansion\" \/>\n<meta name=\"twitter:site\" content=\"@bp_expansion\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Chuck Brotman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"4 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":[\"Article\",\"BlogPosting\"],\"@id\":\"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/blueprintexpansion.com\/blog\/is-there-safety-in-early-stage-today\/\"},\"author\":{\"name\":\"Chuck Brotman\",\"@id\":\"https:\/\/blueprintexpansion.com\/#\/schema\/person\/61cc5f6d4f93c400c090c3e7d9728acb\"},\"headline\":\"Is There Safety in Early-Stage Today?\",\"datePublished\":\"2022-05-20T21:02:22+00:00\",\"dateModified\":\"2022-10-19T23:23:20+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/blueprintexpansion.com\/blog\/is-there-safety-in-early-stage-today\/\"},\"wordCount\":1303,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/blueprintexpansion.com\/#organization\"},\"articleSection\":[\"Hiring\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/blueprintexpansion.com\/blog\/is-there-safety-in-early-stage-today\/\",\"url\":\"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/\",\"name\":\"Is There Safety in Early-Stage Today? - Blueprint\",\"isPartOf\":{\"@id\":\"https:\/\/blueprintexpansion.com\/#website\"},\"datePublished\":\"2022-05-20T21:02:22+00:00\",\"dateModified\":\"2022-10-19T23:23:20+00:00\",\"description\":\"Is now a time for sales, marketing, & customer success talent to prioritize working at larger companies over mid-market and tech startups?\",\"breadcrumb\":{\"@id\":\"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/blueprintexpansion.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Is There Safety in Early-Stage Today?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/blueprintexpansion.com\/#website\",\"url\":\"https:\/\/blueprintexpansion.com\/\",\"name\":\"Blueprint\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/blueprintexpansion.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/blueprintexpansion.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/blueprintexpansion.com\/#organization\",\"name\":\"Blueprint Expansion\",\"url\":\"https:\/\/blueprintexpansion.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blueprintexpansion.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2021\/07\/Blueprint-Logo-LORES-300.png\",\"contentUrl\":\"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2021\/07\/Blueprint-Logo-LORES-300.png\",\"width\":300,\"height\":168,\"caption\":\"Blueprint Expansion\"},\"image\":{\"@id\":\"https:\/\/blueprintexpansion.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.linkedin.com\/company\/blueprint-expansion\/\",\"https:\/\/twitter.com\/bp_expansion\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/blueprintexpansion.com\/#\/schema\/person\/61cc5f6d4f93c400c090c3e7d9728acb\",\"name\":\"Chuck Brotman\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blueprintexpansion.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/f84392f5c9d7bcc684565c8d14d4eab9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/f84392f5c9d7bcc684565c8d14d4eab9?s=96&d=mm&r=g\",\"caption\":\"Chuck Brotman\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Is There Safety in Early-Stage Today? - Blueprint","description":"Is now a time for sales, marketing, & customer success talent to prioritize working at larger companies over mid-market and tech startups?","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/","og_locale":"en_US","og_type":"article","og_title":"Is There Safety in Early-Stage Today? - Blueprint","og_description":"Is now a time for sales, marketing, & customer success talent to prioritize working at larger companies over mid-market and tech startups?","og_url":"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/","og_site_name":"Blueprint","article_published_time":"2022-05-20T21:02:22+00:00","article_modified_time":"2022-10-19T23:23:20+00:00","og_image":[{"width":400,"height":400,"url":"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2022\/05\/stacked-meditation-rocks.jpg","type":"image\/jpeg"}],"author":"Chuck Brotman","twitter_card":"summary_large_image","twitter_creator":"@bp_expansion","twitter_site":"@bp_expansion","twitter_misc":{"Written by":"Chuck Brotman","Est. reading time":"4 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":["Article","BlogPosting"],"@id":"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/#article","isPartOf":{"@id":"https:\/\/blueprintexpansion.com\/blog\/is-there-safety-in-early-stage-today\/"},"author":{"name":"Chuck Brotman","@id":"https:\/\/blueprintexpansion.com\/#\/schema\/person\/61cc5f6d4f93c400c090c3e7d9728acb"},"headline":"Is There Safety in Early-Stage Today?","datePublished":"2022-05-20T21:02:22+00:00","dateModified":"2022-10-19T23:23:20+00:00","mainEntityOfPage":{"@id":"https:\/\/blueprintexpansion.com\/blog\/is-there-safety-in-early-stage-today\/"},"wordCount":1303,"commentCount":0,"publisher":{"@id":"https:\/\/blueprintexpansion.com\/#organization"},"articleSection":["Hiring"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/blueprintexpansion.com\/blog\/is-there-safety-in-early-stage-today\/","url":"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/","name":"Is There Safety in Early-Stage Today? - Blueprint","isPartOf":{"@id":"https:\/\/blueprintexpansion.com\/#website"},"datePublished":"2022-05-20T21:02:22+00:00","dateModified":"2022-10-19T23:23:20+00:00","description":"Is now a time for sales, marketing, & customer success talent to prioritize working at larger companies over mid-market and tech startups?","breadcrumb":{"@id":"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.linkedin.com\/pulse\/safety-early-stage-today-chuck-brotman\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blueprintexpansion.com\/"},{"@type":"ListItem","position":2,"name":"Is There Safety in Early-Stage Today?"}]},{"@type":"WebSite","@id":"https:\/\/blueprintexpansion.com\/#website","url":"https:\/\/blueprintexpansion.com\/","name":"Blueprint","description":"","publisher":{"@id":"https:\/\/blueprintexpansion.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blueprintexpansion.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/blueprintexpansion.com\/#organization","name":"Blueprint Expansion","url":"https:\/\/blueprintexpansion.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blueprintexpansion.com\/#\/schema\/logo\/image\/","url":"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2021\/07\/Blueprint-Logo-LORES-300.png","contentUrl":"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2021\/07\/Blueprint-Logo-LORES-300.png","width":300,"height":168,"caption":"Blueprint Expansion"},"image":{"@id":"https:\/\/blueprintexpansion.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.linkedin.com\/company\/blueprint-expansion\/","https:\/\/twitter.com\/bp_expansion"]},{"@type":"Person","@id":"https:\/\/blueprintexpansion.com\/#\/schema\/person\/61cc5f6d4f93c400c090c3e7d9728acb","name":"Chuck Brotman","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blueprintexpansion.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/f84392f5c9d7bcc684565c8d14d4eab9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/f84392f5c9d7bcc684565c8d14d4eab9?s=96&d=mm&r=g","caption":"Chuck Brotman"}}]}},"_links":{"self":[{"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/posts\/243137"}],"collection":[{"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/comments?post=243137"}],"version-history":[{"count":0,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/posts\/243137\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/media\/243138"}],"wp:attachment":[{"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/media?parent=243137"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/categories?post=243137"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/tags?post=243137"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}