{"id":454,"date":"2020-04-17T19:08:08","date_gmt":"2020-04-17T19:08:08","guid":{"rendered":"https:\/\/blueprintexpansion.com\/?p=454"},"modified":"2021-08-19T03:22:53","modified_gmt":"2021-08-19T03:22:53","slug":"the-industry-insider-fallacy-in-sales-hiring","status":"publish","type":"post","link":"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/","title":{"rendered":"The Industry Insider Hiring Fallacy"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;3.22&#8243;][et_pb_row _builder_version=&#8221;3.25&#8243; background_size=&#8221;initial&#8221; background_position=&#8221;top_left&#8221; background_repeat=&#8221;repeat&#8221;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;3.25&#8243; custom_padding=&#8221;|||&#8221; custom_padding__hover=&#8221;|||&#8221;][et_pb_text _builder_version=&#8221;4.9.10&#8243; background_size=&#8221;initial&#8221; background_position=&#8221;top_left&#8221; background_repeat=&#8221;repeat&#8221;]<\/p>\n<h3>Introduction<\/h3>\n<p>Most business leaders see hiring exceptional sales talent as a top priority. However, many do not understand how to do this consistently. They focus on the industry experience of a candidate instead of the skills and behaviors needed for success. Let’s look at why this mistake – the “industry insider fallacy” – happens, and how companies can avoid it.<\/p>\n<p>&nbsp;<\/p>\n<h5>The Industry Insider Fallacy<\/h5>\n<p>When running sales searches, leaders often look for individuals capable of achieving revenue success quickly. While most sales plan includes runway for new hires to ramp to full productivity, hiring managers think a lot about how to get new additions to the team to exceed those expectations. Given the pressures to achieving revenue numbers, they want their new hires to make an early splash.<\/p>\n<p>Additionally, it’s common for sales leaders to look for people with a background in the company’s industry or software category. The thought process looks like this: “if I can find someone with prior experience in our market, I will be more confident they’ll come with a book of business and ready to close deals quickly. They will onboard much faster and need less management oversight. I’m hiring individuals who can teach us about our own market in the process and provide competitor insights.”<\/p>\n<p>On its surface, this thinking may seem reasonable, but the reality is very different. Hiring for experience or industry background often produces mixed results at best. It reflects a basic <a href=\"https:\/\/www.ehstoday.com\/safety\/article\/21915814\/are-you-hiring-the-wrong-person\" target=\"_blank\" rel=\"noopener\">attribution error<\/a>, or a failure to understand the factors responsible for success in given roles. In fact, <a href=\"https:\/\/hbr.org\/2019\/09\/experience-doesnt-predict-a-new-hires-success\" target=\"_blank\" rel=\"noopener\">studies have shown little correlation<\/a> between previous industry experience and better performance. How can companies avoid this and find qualified talent?<\/p>\n<p>In our opinion, organizations that prioritize skills and behaviors achieve success more consistently. Rather than making decisions based on “what everyone else is doing,” they build assessments into their hiring processes to find the best talent available, irrespective of credentials. They avoid what we’ll call here, the “industry insider fallacy.”<\/p>\n<p>&nbsp;<\/p>\n<h5>Importance of Hiring Process<\/h5>\n<p>In order to understand how the best companies avoid the industry insider fallacy, let’s start with a definition of a hiring process. Put simply, a hiring process is an organized approach to identifying, attracting, and securing talent. It typically begins with an outline of the role needs and compensation levels, but also includes:<\/p>\n<ul>\n<li>Mapping out the skills and behaviors needed for success in the roleDefining a step-by-step approach to assessing candidates from first screen to close, using some system of record, typically an ATS, for data management<\/li>\n<li>Training of process participants, and oversight to ensure these individuals remain consistently involved and unconscious bias is removed during interviews<\/li>\n<li>A plan for sourcing and attracting talent, including creation of a job description, publication to job boards, and tactics defined for reaching out to “passive” candidates in the market<\/li>\n<\/ul>\n<p>At its core, a clear hiring process promotes alignment across an organization on what success looks like from initial recruitment efforts through onboarding and ramp. It’s the cornerstone to execution for any high-performing sales organization, whether a <a href=\"https:\/\/review.firstround.com\/the-anatomy-of-the-perfect-sales-hiring-process\" target=\"_blank\" rel=\"noopener\">start-up<\/a> or a mature business.<\/p>\n<p>&nbsp;<\/p>\n<h5>Alignment and Success Criteria<\/h5>\n<p>In fact, many organizations overlook the importance of alignment, particularly between recruiters and hiring managers. In companies using third-party agencies, sales leaders often encourage their managers to run the process solo, “go with their guts,” and tap their own existing networks to attract candidates. They focus heavily on passive candidates, despite <a href=\"https:\/\/hbr.org\/2019\/05\/your-approach-to-hiring-is-all-wrong\" target=\"_blank\" rel=\"noopener\">limited evidence<\/a> that this strategy yields better results. They put little thought into defining questions in advance to assess skills and behaviors, or ensuring that a consistent number of participants are engaged in a process to cross-validate candidates or deepen assessment in key areas.<\/p>\n<p>Making matters worse, few take the time to identify success criteria in advance. While it may seem obvious that “success” in sales hiring should be based on quota attainment, other factors often get ignored. For example, tracking acquisition costs for new talent and retention rates can provide insight into overall sales costs. Measuring candidate experience feedback can help companies understand market perceptions that influence their brand. Hiring <a href=\"\/blog\/how-tech-job-concentration-hurts-your-talent-strategy\/\">non-traditional talent outside of tech hubs<\/a> can reduce costs of compensation. When companies do not define success criteria, hiring implicitly becomes only about who can “hit the ground running.” This leads to an obsession with hiring candidates on industry experience. It makes the search process one-dimensional, and it’s not even assured to support faster revenue success.<\/p>\n<p>&nbsp;<\/p>\n<h5>Skills and Behaviors vs Experience<\/h5>\n<p>In fact, a well-defined hiring process typically makes industry experience a less significant criteria for hiring. Why is this the case?<\/p>\n<p>Strong sales organizations want to understand context. What was the culture at the previous company that may have contributed to individual sales success, or hindered it? How did the business go to market, work with buyers, and develop sales talent as a whole? For many sales professionals, industry experience may be a sign of a passion for specific types of business problems, but perhaps just as frequently, it could be an indication of a salesperson being reluctant to “leave their comfort zone” and hence continuing to interview with companies in the same market.<\/p>\n<p>Rather than thinking too much about the “relevant experience” a candidate brings to an interview, the best companies look at it as part of an overall evaluation – neither punishing one for industry background, nor looking too favorably upon it without digging deeper. These companies want to understand:<\/p>\n<ul>\n<li>Does the candidate have the required skills to be successful selling to the kinds of buyers we see in the market? In other words, do they exhibit strong verbal communication and writing skills? Do they show an ability to listen actively? What is their approach to time management?<\/li>\n<li>What are the behaviors of the individual and how do they align to the core values of the company? Do they exhibit commitment to teamwork? How well do they handle feedback and can they implement it? Are they respectful of others?<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h6>Conclusion: Establish a Strong Hiring Process<\/h6>\n<p>Hiring great talent for sales – like selling itself – must be anchored in a clear and repeatable process for all participants. By establishing this early and aligning it to finding the skills and behaviors needed for success in a role, most companies will find themselves less likely to make the industry insider fallacy. Empowered by the confidence in their process and their commitment to measuring results over time, these become the most exceptional companies capable of attracting the best talent imaginable across the country.<\/p>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Companies often focus too much on industry sales experience when hiring. Instead, consider more skills and behaviors to be successful.<\/p>\n","protected":false},"author":6,"featured_media":455,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"on","_et_pb_old_content":"<p>TIPS FOR EXPANSION IN THE SOUTHEAST<\/p><p>Although 2020 has been a challenging year, the growth of remote hiring has fostered new opportunities across the country. Companies have learned they can hire exceptional talent at reasonable salaries while reducing overhead. Employees, no longer faced with paying exorbitant rents to live near headquarters, now have options to relocate anywhere.<\/p><p>So what’s the problem?<\/p><p>While great people resides everywhere, much of the southeast get less attention due to preconceptions and bias.  In fact, some regions here likely offer the most promising opportunities for responsible growth.<\/p><p>Interested in talent expansion in the southeast?  Here are 3 tips to ensure the best likelihood for success.<\/p><p>1. CHECK YOUR ASSUMPTIONS (AND UNCONSCIOUS BIAS) AT THE DOOR<br \/>Ensure you put consistent process in place to guard against bias.  Sounds simple enough right?<\/p><p>What happens when you don’t recognize a candidate’s university?  How do you react when you hear a ‘tang’ in the way someone pronounces certain words? Are you projecting assumptions onto the candidate from across the Zoom?<\/p><p>After working for multiple tech startups in Nashville, I’ve heard it all about the local talent pool. People here are “too polite,” slow to act, dripping in southern drawl, lacking “relevant experience.” These assumptions harm both employer and employee alike.<\/p><p>Also, take a look at how regional bias impacts your diversity and inclusion goals. The southeast is home to some of the most well renowned and prestigious HBCU’s in America. Here we have metros like Memphis (where I grew up) with diverse and established Black American populations. Neglecting these locations may mean you are constraining your remote search to areas of the country with less of the diversity needed to strengthen your company.<\/p><p>2. CONSIDER OPPORTUNITIES FOR INCENTIVES<br \/>The southeast boasts attractive grant opportunities and a relatively modest cost of living. Ensure you understand the landscape for employer and employee alike. Even if you only plan to make a modest number of hires in a certain remote region or state, you could be missing out on potential benefits available.<\/p><p>Before investing in hiring and recruitment, learn thoroughly about the partnerships and resources available to help. State, county, and chamber resources can provide guidance on grants and incentives available.  Many regional universities have different programs available as well to help promote your company’s presence to undergraduates and graduate students.<\/p><p>3. PLAN WITH PURPOSE<br \/>For all of the talk about the value of remote work in giving people opportunities to live anywhere, it’s difficult to attract exceptional people in remote regions without a clear plan. Employee prospects want to understand your vision and objectives for hiring in their region, and the dependencies.  Are you simply searching for people anywhere because your office is currently closed?  Are you considering opening up a satellite office or temporary presence in another region?  Do you plan to change you policies down the line to require people to live near headquarters?  Be transparent and open in your communication at all times.  This does not mean you need to have your hiring plan set in stone, or all of the specific details figured out.  But it does mean you should at least have a roadmap.<\/p><p>Also, when planning, consider the wider range of benefits to concentrating your efforts on one or specific regions in the country. What does success look like? Aside from being able to access state grants that reduce your operating expenses, taking a geographical focus to your expansion can help you meet other business goals, including improving sales execution with personnel closer to your sales prospects, improving customer relationships with increased hours of operations, and achieving resiliency in the event that you decide to shut down your current headquarters.<\/p><p>Consider your vision for potential relocation opportunities for employees looking to move out from headquarters.  You may want to get temporary or permanent office space, ensure you have a strong broker partner to guide your search efforts and give you a deep sense of the options available in the region.<\/p><p>TALENT EXPANSION – CLOSE<br \/>If you’ve decided you want to focus on the southeast, that’s great! Now what? For tips on how to best deploy your resources click on the link here requesting a 30 minute free consultation to evaluate your options and provide tailored next steps.<\/p>","_et_gb_content_width":""},"categories":[9],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.10 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Industry Insider Hiring Fallacy - Blueprint<\/title>\n<meta name=\"description\" content=\"Most business leaders see hiring exceptional sales talent as a top priority. However, many do not understand how to do this consistently.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Industry Insider Hiring Fallacy - Blueprint\" \/>\n<meta property=\"og:description\" content=\"Most business leaders see hiring exceptional sales talent as a top priority. However, many do not understand how to do this consistently.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/\" \/>\n<meta property=\"og:site_name\" content=\"Blueprint\" \/>\n<meta property=\"article:published_time\" content=\"2020-04-17T19:08:08+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-08-19T03:22:53+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2020\/04\/industry-insider-hiring-fallacy-blog.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"400\" \/>\n\t<meta property=\"og:image:height\" content=\"400\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Chuck Brotman\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@bp_expansion\" \/>\n<meta name=\"twitter:site\" content=\"@bp_expansion\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Chuck Brotman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"4 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":[\"Article\",\"BlogPosting\"],\"@id\":\"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/\"},\"author\":{\"name\":\"Chuck Brotman\",\"@id\":\"https:\/\/blueprintexpansion.com\/#\/schema\/person\/61cc5f6d4f93c400c090c3e7d9728acb\"},\"headline\":\"The Industry Insider Hiring Fallacy\",\"datePublished\":\"2020-04-17T19:08:08+00:00\",\"dateModified\":\"2021-08-19T03:22:53+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/\"},\"wordCount\":1154,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/blueprintexpansion.com\/#organization\"},\"articleSection\":[\"Hiring\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/\",\"url\":\"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/\",\"name\":\"The Industry Insider Hiring Fallacy - Blueprint\",\"isPartOf\":{\"@id\":\"https:\/\/blueprintexpansion.com\/#website\"},\"datePublished\":\"2020-04-17T19:08:08+00:00\",\"dateModified\":\"2021-08-19T03:22:53+00:00\",\"description\":\"Most business leaders see hiring exceptional sales talent as a top priority. However, many do not understand how to do this consistently.\",\"breadcrumb\":{\"@id\":\"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/blueprintexpansion.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Industry Insider Hiring Fallacy\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/blueprintexpansion.com\/#website\",\"url\":\"https:\/\/blueprintexpansion.com\/\",\"name\":\"Blueprint\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/blueprintexpansion.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/blueprintexpansion.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/blueprintexpansion.com\/#organization\",\"name\":\"Blueprint Expansion\",\"url\":\"https:\/\/blueprintexpansion.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blueprintexpansion.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2021\/07\/Blueprint-Logo-LORES-300.png\",\"contentUrl\":\"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2021\/07\/Blueprint-Logo-LORES-300.png\",\"width\":300,\"height\":168,\"caption\":\"Blueprint Expansion\"},\"image\":{\"@id\":\"https:\/\/blueprintexpansion.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.linkedin.com\/company\/blueprint-expansion\/\",\"https:\/\/twitter.com\/bp_expansion\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/blueprintexpansion.com\/#\/schema\/person\/61cc5f6d4f93c400c090c3e7d9728acb\",\"name\":\"Chuck Brotman\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blueprintexpansion.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/f84392f5c9d7bcc684565c8d14d4eab9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/f84392f5c9d7bcc684565c8d14d4eab9?s=96&d=mm&r=g\",\"caption\":\"Chuck Brotman\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Industry Insider Hiring Fallacy - Blueprint","description":"Most business leaders see hiring exceptional sales talent as a top priority. However, many do not understand how to do this consistently.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/","og_locale":"en_US","og_type":"article","og_title":"The Industry Insider Hiring Fallacy - Blueprint","og_description":"Most business leaders see hiring exceptional sales talent as a top priority. However, many do not understand how to do this consistently.","og_url":"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/","og_site_name":"Blueprint","article_published_time":"2020-04-17T19:08:08+00:00","article_modified_time":"2021-08-19T03:22:53+00:00","og_image":[{"width":400,"height":400,"url":"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2020\/04\/industry-insider-hiring-fallacy-blog.jpg","type":"image\/jpeg"}],"author":"Chuck Brotman","twitter_card":"summary_large_image","twitter_creator":"@bp_expansion","twitter_site":"@bp_expansion","twitter_misc":{"Written by":"Chuck Brotman","Est. reading time":"4 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":["Article","BlogPosting"],"@id":"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/#article","isPartOf":{"@id":"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/"},"author":{"name":"Chuck Brotman","@id":"https:\/\/blueprintexpansion.com\/#\/schema\/person\/61cc5f6d4f93c400c090c3e7d9728acb"},"headline":"The Industry Insider Hiring Fallacy","datePublished":"2020-04-17T19:08:08+00:00","dateModified":"2021-08-19T03:22:53+00:00","mainEntityOfPage":{"@id":"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/"},"wordCount":1154,"commentCount":0,"publisher":{"@id":"https:\/\/blueprintexpansion.com\/#organization"},"articleSection":["Hiring"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/","url":"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/","name":"The Industry Insider Hiring Fallacy - Blueprint","isPartOf":{"@id":"https:\/\/blueprintexpansion.com\/#website"},"datePublished":"2020-04-17T19:08:08+00:00","dateModified":"2021-08-19T03:22:53+00:00","description":"Most business leaders see hiring exceptional sales talent as a top priority. However, many do not understand how to do this consistently.","breadcrumb":{"@id":"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/blueprintexpansion.com\/blog\/the-industry-insider-fallacy-in-sales-hiring\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blueprintexpansion.com\/"},{"@type":"ListItem","position":2,"name":"The Industry Insider Hiring Fallacy"}]},{"@type":"WebSite","@id":"https:\/\/blueprintexpansion.com\/#website","url":"https:\/\/blueprintexpansion.com\/","name":"Blueprint","description":"","publisher":{"@id":"https:\/\/blueprintexpansion.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blueprintexpansion.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/blueprintexpansion.com\/#organization","name":"Blueprint Expansion","url":"https:\/\/blueprintexpansion.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blueprintexpansion.com\/#\/schema\/logo\/image\/","url":"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2021\/07\/Blueprint-Logo-LORES-300.png","contentUrl":"https:\/\/blueprintexpansion.com\/wp-content\/uploads\/2021\/07\/Blueprint-Logo-LORES-300.png","width":300,"height":168,"caption":"Blueprint Expansion"},"image":{"@id":"https:\/\/blueprintexpansion.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.linkedin.com\/company\/blueprint-expansion\/","https:\/\/twitter.com\/bp_expansion"]},{"@type":"Person","@id":"https:\/\/blueprintexpansion.com\/#\/schema\/person\/61cc5f6d4f93c400c090c3e7d9728acb","name":"Chuck Brotman","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blueprintexpansion.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/f84392f5c9d7bcc684565c8d14d4eab9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/f84392f5c9d7bcc684565c8d14d4eab9?s=96&d=mm&r=g","caption":"Chuck Brotman"}}]}},"_links":{"self":[{"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/posts\/454"}],"collection":[{"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/comments?post=454"}],"version-history":[{"count":0,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/posts\/454\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/media\/455"}],"wp:attachment":[{"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/media?parent=454"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/categories?post=454"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blueprintexpansion.com\/wp-json\/wp\/v2\/tags?post=454"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}